---
kind: property
id: P:Autodesk.Revit.DB.Segment.Roughness
source: html/1293fad8-283d-f8cb-93c8-ff1af4e4eec9.htm
---
# Autodesk.Revit.DB.Segment.Roughness Property

The roughness value for given material.

## Syntax (C#)
```csharp
public double Roughness { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.DisabledDisciplineException** - When setting this property: None of the following disciplines is enabled: Mechanical Electrical Piping.